This file demonstrates code used to read in data on household
expenditures and consumption in Liberia, using data from a 2014
LSMS-style survey from the World Bank.

The source files are stata files (with a "dta" extension).  We'll
demonstrate the use of a python module =lsms.tools= to extract
information on household characteristics, expenditures, and
consumption.  With these data extracts, we'll then demonstrate the use
of these to estimate a demand system.

** Household Composition
 #+begin_src ipython :tangle testcomp.py
import pandas as pd

# List of input stata files for household roster
files = ['2014/HH_B.dta']

df = pd.read_stata(files[0],convert_categoricals=True)
df.head()
 #+end_src


 Define some key variables:
 #+begin_src ipython :tangle testcomp.py
HHID = 'hh_id'     # Variable name for household identifier (see stata file)
sex = 'hh_b_02'    # Variable giving sex
age = 'hh_b_06'    # Variable giving age
months_spent = 'hh_b_10' # Variable for months resident in last year
 #+end_src

 Now, process household roster using function in =lsms.tools=.
 #+name: hh_compositions
 #+BEGIN_SRC ipython :noweb no-export :results output table :tangle testcomp.py
# -*- coding: utf-8 -*-
from lsms.tools import get_household_roster

# Now get household composition variables
hh_composition = get_household_roster(fn=files[0],
                                      HHID=HHID,
                                      sex=sex,
                                      age=age,
                                      months_spent=months_spent)

hh_composition.columns.name = 'k'

hh_composition.index.name = 'j'

hh_composition['t'] = 2014

hh_composition['m'] = 'Liberia'

hh_composition = hh_composition.reset_index().set_index(['j','t','m'])

hh_composition.to_pickle('./tmp/hh_composition.df')
hh_composition.head()
 #+END_SRC

 #+results: hh_compositions
 :results:
 # Out[4]:
 # text/plain
 : k                   girls  boys  men  women  




